# Pandas - Code Along - IPL Dataset Analysis

In [1]:
# Path for the Dataset:

path = "c:/users/kruti karia/desktop/ipl_data.csv"

In [2]:
# Import Packages/Modules:

import numpy as np
import pandas as pd

In [4]:
# Read the Dataset from the path:

data = pd.read_csv(path)

In [8]:
# Dataset Attributes:

data.info()

data.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 136522 entries, 0 to 136521
Data columns (total 24 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   match_code       136522 non-null  int64
 1   date             136522 non-null  object
 2   city             136522 non-null  object
 3   venue            136522 non-null  object
 4   team1            136522 non-null  object
 5   team2            136522 non-null  object
 6   toss_winner      136522 non-null  object
 7   toss_decision    136522 non-null  object
 8   winner           134704 non-null  object
 9   win_type         134704 non-null  object
 10  win_margin       134704 non-null  float64
 11  inning           136522 non-null  int64
 12  delivery         136522 non-null  float64
 13  batting_team     136522 non-null  object
 14  batsman          136522 non-null  object
 15  non_striker      136522 non-null  object
 16  bowler           136522 non-null  object
 17  runs             136522 non-null  int64
 18  extras           136522 non-null  int64
 19  total            136522 non-null  int64
 20  extras_type      7458 non-null    object
 21  player_out       6715 non-null    object
 22  wicket_kind      6715 non-null    object
 23  wicket_fielders  4865 non-null    object
dtypes: float64(2), int64(5), object(17)
memory usage: 25.0+ MB

,match_code,win_margin,inning,delivery,runs,extras,total
count,136522.000000,134704.000000,136522.000000,136522.000000,136522.000000,136522.000000,136522.000000
mean,590895.686534,17.389729,1.481769,9.510885,1.214881,0.069644,1.284526
std,195529.048724,21.764597,0.499669,5.672315,1.589211,0.353353,1.578578
min,335982.000000,1.000000,1.000000,0.100000,0.000000,0.000000,0.000000
25%,419135.000000,6.000000,1.000000,4.500000,0.000000,0.000000,0.000000
50%,548348.000000,8.000000,1.000000,9.400000,1.000000,0.000000,1.000000
75%,733997.000000,22.000000,2.000000,14.300000,1.000000,0.000000,1.000000
max,981019.000000,144.000000,2.000000,19.900000,6.000000,7.000000,7.000000

In [15]:
# Find the list of unique cities where matches were played:
unique_cities = data['city'].unique()
print('The List of unique cities where the matches were played are \n',unique_cities)

The List of unique cities where the matches were played are
 ['East London' 'Port Elizabeth' 'Centurion' 'neutral_venue' 'Chennai'
 'Jaipur' 'Kolkata' 'Delhi' 'Chandigarh' 'Hyderabad' 'Ranchi' 'Mumbai'
 'Bangalore' 'Dharamsala' 'Pune' 'Rajkot' 'Durban' 'Cuttack' 'Cape Town'
 'Ahmedabad' 'Johannesburg' 'Visakhapatnam' 'Abu Dhabi' 'Raipur' 'Kochi'
 'Kimberley' 'Nagpur' 'Bloemfontein' 'Indore' 'Kanpur']

In [24]:
# Find the columns which contains null values if any ?

null_values = data.isnull().sum()
null_values = list(null_values[null_values>0].index)
print("The Columns with nul values are \n",null_values)

The Columns with nul values are
 ['winner', 'win_type', 'win_margin', 'extras_type', 'player_out', 'wicket_kind', 'wicket_fielders']

In [55]:
# List down top 5 most played venues

top_five_venues = data.groupby(['venue'])[['match_code']].nunique().sort_values(by = 'match_code',ascending = False).head().index
print("The top 5 Venues are \n",list(top_five_venues))

The top 5 Venues are
 ['M Chinnaswamy Stadium', 'Eden Gardens', 'Feroz Shah Kotla', 'Wankhede Stadium', 'MA Chidambaram Stadium, Chepauk']

In [67]:
# Make a runs count frequency table

runs_count = data['runs'].value_counts()
print("The Runs count frequency table is \n",runs_count)

The Runs count frequency table is
 0    55870
1    50087
4    15409
2     8835
6     5806
3      473
5       42
Name: runs, dtype: int64

In [97]:
# How many seasons were played and in which year they were played 

data['year'] = data['date'].str[:4]
print("The No. of seasons played are",data['year'].nunique())
print("The year's in which the season are played are \n",list(data['year'].unique()))

The No. of seasons played are 9
The year's in which the season are played are
 ['2009', '2014', '2011', '2008', '2015', '2010', '2013', '2012', '2016']

In [105]:
# No. of matches played per season

matches_played_per_season = data.groupby(['year'])['match_code'].nunique()
print("Matches played per season are \n",matches_played_per_season)

Matches played per season are
 year
2008    58
2009    57
2010    60
2011    73
2012    74
2013    76
2014    60
2015    59
2016    60
Name: match_code, dtype: int64

In [114]:
# Total runs across the seasons

total_runs_per_season = data.groupby(['year'])['total'].sum()
print("The total runs acroos all the seasons are \n",total_runs_per_season)

The total runs acroos all the seasons are
 year
2008    17936
2009    16320
2010    18862
2011    21154
2012    22451
2013    22541
2014    18909
2015    18331
2016    18862
Name: total, dtype: int64

In [140]:
# Teams who have scored more than 200+ runs. Show the top 10 results

top_10_results = data.groupby(['match_code','inning','team1','team2'])['total'].sum().reset_index()
top_10_results = top_10_results[top_10_results['total']>200]
top_10_results.nlargest(10,'total')

,match_code,inning,team1,team2,total
701,598027,1,Royal Challengers Bangalore,Pune Warriors,263
1118,980987,1,Royal Challengers Bangalore,Gujarat Lions,248
292,419137,1,Chennai Super Kings,Rajasthan Royals,246
2,335983,1,Kings XI Punjab,Chennai Super Kings,240
1002,829795,1,Mumbai Indians,Royal Challengers Bangalore,235
472,501260,1,Kings XI Punjab,Royal Challengers Bangalore,232
398,501223,1,Delhi Daredevils,Kings XI Punjab,231
851,733987,1,Kings XI Punjab,Chennai Super Kings,231
1038,980907,1,Royal Challengers Bangalore,Sunrisers Hyderabad,227
911,734047,1,Chennai Super Kings,Kings XI Punjab,226

In [167]:
# Which team has the highest win count in their respective seasons ?

match_wise_data = data.drop_duplicates(subset='match_code',keep='first').reset_index(drop=True)
match_wise_data = match_wise_data.groupby('year')['winner'].value_counts(ascending = False)
print("Highest Win Count in Respective Seasons are",match_wise_data)

Highest Win Count in Respective Seasons are year  winner
2008  Rajasthan Royals           13
      Kings XI Punjab            10
      Chennai Super Kings         9
      Delhi Daredevils            7
      Mumbai Indians              7
                                 ..
2016  Kolkata Knight Riders       8
      Delhi Daredevils            7
      Mumbai Indians              7
      Rising Pune Supergiants     5
      Kings XI Punjab             4
Name: winner, Length: 76, dtype: int64